In [3]:
import pandas as pd

In [4]:
df = pd.read_csv('./data/titanic.csv')

##  1. Remove unwanted data

In [5]:
df2 = df.copy()

### df.drop
+ inplace mặc định là false:
    + True: lưu lại vào df
    + Fales: không lưu lại vào df.
+ xóa cột df.drop(columns=[list column])
+ xóa dòng df.drop(index=[])

In [6]:
df2.sample(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
415,416,0,3,"Meek, Mrs. Thomas (Annie Louise Rowley)",female,NaN,0,0,343095,8.05,NaN,S
106,107,1,3,"Salkjelsvik, Miss. Anna Kristine",female,21.0,0,0,343120,7.65,NaN,S

In [7]:
# xóa cột
df2.drop(columns=['SibSp','Parch'], inplace=True)

In [8]:
df2.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S

In [9]:
# xóa dòng
df2.drop(index=[0,1,3], inplace=True)

In [10]:
df2.head(3)

,PassengerId,Survived,Pclass,Name,Sex,Age,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,330877,8.4583,NaN,Q

### df.remane(columns=distionry)

In [11]:
df2 = df2.rename(columns={'Name': 'PassengerName', 'SibSp':'NumberSibling'})
df2.head(2)

,PassengerId,Survived,Pclass,PassengerName,Sex,Age,Ticket,Fare,Cabin,Embarked
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.925,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.050,NaN,S

### df.columns
+ thây đổi tên tất cả các cột
+ là một list, list số lượng giá trị phải bằng số lượng cột ở trong df

In [12]:
df2.columns = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '10']
df2.head(3)

,1,2,3,4,5,6,7,8,9,10
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,STON/O2. 3101282,7.9250,NaN,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,373450,8.0500,NaN,S
5,6,0,3,"Moran, Mr. James",male,NaN,330877,8.4583,NaN,Q

##  2. Check and change datatype

In [13]:
df2 = df.copy()
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

+ Ép kiểu dữ liệu:
    + df['columns'] = df.astype('data type')
+ Ép kiểu dữ liệu datetime:
    + df['columns'] = pd.to_datetime('columns', format='')

In [14]:
df2['Survived'] = df2['Survived'].astype('float')

In [15]:
df2['PassengerId'] = df['PassengerId'].astype('str')

In [16]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    object
 1   Survived     891 non-null    float64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(3), int64(3), object(6)
memory usage: 83.7+ KB

## 3. Working with Missing Values
+ Missing Values: là các giá trị bị thiếu (Null, NaN), do người dùng không điền vào, do dữ liệu bị mất trong quá trình truyền tải dữ liệu, lỗi do lập trính
+ Trong pandas, một số phương pháp loại bỏ hoặc thây thế các giá trị null
    * `isna()` or `isnull()`: lấy ra các trường bị null
    * `notna()` or `notnull()`: lấy ra các trường không bị null
    * `dropna()`: loại bỏ các trường
    * `fillna()`: thây thế giá trị các trường bằng giá trị khác

In [17]:
data = pd.DataFrame({
    'Column_1': [1, None, 2],
    'Column_2': [2, 3, 5],
    'Column_3': [None, 4, 6]
})

In [18]:
data

   Column_1  Column_2  Column_3
0       1.0         2       NaN
1       NaN         3       4.0
2       2.0         5       6.0

### df.dropna
+ axis = 0: lọc theo các ròng, xóa ròng nào có giá trị là missing value
+ axis = 1: lọc theo các cột, xóa cột nào có giá trị là missing value

In [19]:
data.dropna(axis=0)

   Column_1  Column_2  Column_3
2       2.0         5       6.0

In [20]:
data.dropna(axis=1)

   Column_2
0         2
1         3
2         5

### df.fillna

In [21]:
data.fillna(10)

   Column_1  Column_2  Column_3
0       1.0         2      10.0
1      10.0         3       4.0
2       2.0         5       6.0

Trong python
+ False: 0
+ True: 1

In [22]:
df2.isna().head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,False,False,False,False,False,False,False,False,False,False,True,False
1,False,False,False,False,False,False,False,False,False,False,False,False

In [23]:
# lấy ra tổng các cột có giá trị là Null
df2.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

#### Xử lý trường Age

In [24]:
# tỷ lệ giá trị null của trường 'Age' lớn nên không được xóa.
df2['Age'].isna().sum() / df.shape[0] * 100

19.865319865319865

In [25]:
# thay các giá trị null của trường Age bằng giá trị trung bình
df2['Age'] = df2['Age'].fillna(df2['Age'].mean())

In [26]:
# kiểm tra lại
df2['Age'].isna().sum()

0

#### Xử lý trường Embarked

In [27]:
df2[df2['Embarked'].isna()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
61,62,1.0,1,"Icard, Miss. Amelie",female,38.0,0,0,113572,80.0,B28,NaN
829,830,1.0,1,"Stone, Mrs. George Nelson (Martha Evelyn)",female,62.0,0,0,113572,80.0,B28,NaN

In [28]:
# tỷ lệ giá trị null của trường 'Embarked'
df2['Embarked'].isna().sum() / df2.shape[0] * 100

0.22446689113355783

In [29]:
# tỷ lệ giá trị null của trường 'Embarked' nhỏ nên có thể xóa được
df2 = df2[df2['Embarked'].notna()]

In [30]:
# kiểm tra lại
df2['Embarked'].isna().sum()

0

##  4. Handling duplicated data
Check các giá trị lặp đi lặp lại

In [31]:
temp = df2.sample(5)

In [32]:
df2 = pd.concat([df2, temp], axis=0, ignore_index=True)

In [33]:
# lấy ra tổng các giá trị bị duplicate
df2.duplicated().sum()

5

In [34]:
df2[df2.duplicated()]

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
889,271,0.0,1,"Cairns, Mr. Alexander",male,29.699118,0,0,113798,31.0000,NaN,S
890,297,0.0,3,"Hanna, Mr. Mansour",male,23.500000,0,0,2693,7.2292,NaN,C
891,346,1.0,2,"Brown, Miss. Amelia ""Mildred""",female,24.000000,0,0,248733,13.0000,F33,S
892,575,0.0,3,"Rush, Mr. Alfred George John",male,16.000000,0,0,A/4. 20589,8.0500,NaN,S
893,413,1.0,1,"Minahan, Miss. Daisy E",female,33.000000,1,0,19928,90.0000,C78,Q

#### Xóa các gia trị duplicate

In [35]:
df2 = df2.drop_duplicates()

In [36]:
df2.duplicated().sum()

0

##  5. Handle mislabeled and corrupted data
+ Thống kê mô tả (Descriptive Statistics): là phương pháp để mô tả tính chất của tập dữ liệu thông qua các số liệu thống kê, đồ thị và biểu đồ
    + Central Tendency: là độ tập trung của dữ liệu, có 3 giá trị cần lư ý (mean, median, mode)
    + Dispersion: là mức dộ phân tán của các giá trị trong tập dữ liệu
+ Thống kê suy luận (Inferential Statistics)
+ Thống kê mô hình (Modeling Statistics)

<img style="background-color: #fff;"  src='https://i.imgur.com/uKuyHoV.png' width=400>

In [37]:
df['Age'] = df2['Age'].astype('int')

In [38]:
print('Fare mean: ', df['Fare'].mean())
print('Fare median: ', df['Fare'].median())
print('Fare mode: ', df['Pclass'].mode())

Fare mean:  32.204207968574636
Fare median:  14.4542
Fare mode:  0    3
Name: Pclass, dtype: int64

In [39]:
df2['Fare'].describe()

count    889.000000
mean      32.096681
std       49.697504
min        0.000000
25%        7.895800
50%       14.454200
75%       31.000000
max      512.329200
Name: Fare, dtype: float64

<img src="https://einstein.com.sg/wp-content/uploads/2020/08/Mean-Median-Mode-Diagrams.jpg" width="600">

**❊ SPREAD & OUTLIER DETECTION**
+ interquartile range: được sử dụng để đo độ biến động (spread) của một tập dữ liệu, mục đích của IQR là xác định vị trí của những giá trị ngoại lai trong tập dữ liệu 

+ Ngoài ra, IQR cũng có thể được sử dụng để so sánh tính đồng đều của hai hoặc nhiều tập dữ liệu khác nhau. Các tập dữ liệu với IQR nhỏ hơn sẽ có tính đồng đều hơn so với các tập dữ liệu có IQR lớn hơn.

+ OUTLIER(giá trị ngoại lai) là giá trị khác biệt giữa các giá trị khác


<img src='https://cdn.scribbr.com/wp-content/uploads/2020/09/iqr_quartiles.png'>

<img style="background-color: #fff;"  src='https://upload.wikimedia.org/wikipedia/commons/thumb/1/1a/Boxplot_vs_PDF.svg/1200px-Boxplot_vs_PDF.svg.png' width=400>

#### whisker
+ upper whisker: là đường trên

+ lower whisker: là đường dưới

+ Whisker được sử dụng để mô tả và trực quan hóa dữ liệu. Biểu thị các giá trị cực đại và cực tiểu của tập dữ liệu, cũng như phân phối của dữ liệu trong khoảng giữa các giá trị này.

+ Biểu diễn phân tán của dữ liệu: Whisker cho phép người dùng xác định dải giá trị mà dữ liệu phân bố trong đó.

+ Mục đích của whisker là giúp người dùng hiểu được phân bố của dữ liệu, các giá trị trung bình và phân tán của dữ liệu.

In [44]:
Q1 = df['Fare'].quantile(0.25)
Q3 = df['Fare'].quantile(0.75)
print(f'Q1: {Q1}, Q3: {Q3}')

Q1: 7.9104, Q3: 31.0

In [47]:
# Interquanrtiles Range
iqr = Q3 - Q1
print(f'Interquanrtiles Range: {iqr}')

Interquanrtiles Range: 23.0896

In [52]:
upper_whisker = Q3 + 1.5*iqr 
lower_whisker = Q1 - 1.5*iqr

In [53]:
upper_whisker

65.6344

In [54]:
lower_whisker

-26.724